# Types of arguments

- 1- Required positional arguments
- 2- Default arguments
- 3- Keyworded arguments
- 4- Variable length arguments
- 5- Keyworded variable length arguments

# 1- Required positional arguments

- The number of variables inside the function definition and function call should be the same.
- The values are passed from arguments to parameters in the sequence as they are positioned.
- The variables in function call and function definition may be the same or different it doesn't matter.

In [2]:
def course(a,b): # a and b are the parameters
    print(a)
    print(b)

In [3]:
a='DA'
b='DS'
course(a,b)

DA
DS

In [4]:
x='BBA'
y='MBA'

course(x,y)

BBA
MBA

In [5]:
course('B.Tech','MCA')

B.Tech
MCA

In [6]:
course('DA','BA','DE')

TypeError: course() takes 2 positional arguments but 3 were given

In [7]:
course('DS')

TypeError: course() missing 1 required positional argument: 'b'

# 2- Default arguments

- When we assign some value to a variable in function definition itself then it becomes default argument.
- If we don't pass any value for the default argument then it takes the default value.
- If we pass some value to the default argument then it takes the value passed to it.
- Default arguments should always be placed after the positional arguments.
- The variable names in function definition and function call may be the same or different it doesn't matter

In [8]:
def course(a,b='MBA'): # b- default argument and MBA is default value
    print(a)
    print(b)

In [9]:
course('M.Tech')

M.Tech
MBA

In [10]:
course('BBA','BCA')

BBA
BCA

In [11]:
x='MCA'
y='Data Science'

course(x,y)

MCA
Data Science

In [12]:
def course(a,b='MCA',c):
    print(a)
    print(b)
    print(c)

SyntaxError: non-default argument follows default argument (1500537476.py, line 1)

In [14]:
def course(a,c,b='MCA',d='B.Tech'):
    print(a,b,c,d)

In [17]:
course('DA','DS')

# a='DA'
# c='DS'
# b='MCA'
# d='B.Tech'

DA MCA DS B.Tech

In [19]:
course('DA','DS','BA')

DA BA DS B.Tech

In [18]:
# a='DA'
# c='DS'
# b='BA'
# d='B.Tech'

# 3- Keyworded arguments

- When we assign some value to a variable in function call then it is known as keyworded argument.
- The varaible names for the keyworded arguments should be the same in function definition and function call.
- For keyworded arguments the position or order does not matter.
- Keyworded arguments should always be placed after the positional arguments.

In [20]:
def course(a,b):
    print(a)
    print(b)

In [21]:
a='MCA'
course(a,b='MBA') # b is the keyworded argument

MCA
MBA

In [23]:
def course(a,b):
    print(a)
    print(b)

In [24]:
x='MBA'
course(x,y='MCA')

TypeError: course() got an unexpected keyword argument 'y'

In [25]:
def course(a,b,c='MBA'):
    print(a)
    print(b)
    print(c)

In [26]:
course('MCA',b='M.Tech')

MCA
M.Tech
MBA

In [19]:
def course(a,b,c,d='MBA'):
    print(a)
    print(b)
    print(c)
    print(d)
    d='XYZ'
    print(d)

In [33]:
course('BBA','Data Science',c='MBBS')

BBA
Data Science
MBBS
MBA

In [21]:
d='dummy'
course(10,20,d,d='Happy')
print(d)

10
20
dummy
Happy
XYZ
dummy

# 4- Variable length arguments

- If don't know the number of arguments then we use variable length arguments.
- It stores the values inside a tuple.

In [ ]:
def function_name(*a): # a is variable length argument
    code
    code

In [44]:
def course(*a):
    print(a,type(a))

In [51]:
course('DS','DA','DE','BA','BBA','B.Tech','MBA')

('DS', 'DA', 'DE', 'BA', 'BBA', 'B.Tech', 'MBA') <class 'tuple'>

In [62]:
# Create a function that add that can take n numbers as arguments and returns the sum of those numbers

def add(*x):
    s=0
    
    for i in x:
        s+=i
    return s

In [69]:
res=add(10,5,20,45,78)
print(s)

158

In [61]:
t=(10, 5, 6, 72, 55,10)
s=0

for i in t:
    s+=i
print(s)

158

In [70]:
# Create a function that adds two numbers and returns the addition 
# Square the result outside the function and store that in an empty list

# 5- Keyworded variable length arguments

- When we don't know how many keyworded arguments are there then we use keyworded variable length arguments.
- It stores the values in a dictionary.
- The variables becomes the keys and the values becomes the values in the dictionary

In [4]:
def function_name(**a): # a is a keyworded variable length argument
    code
    code

function_name(key_1=value,key_2=value....key_n=value_n)

In [39]:
def course(**a):
    print(a,type(a))

In [41]:
a=course
print(a)

<function course at 0x0000027662CB33A0>

In [8]:
course(a=10,b=20,c=30,d=40)

{'a': 10, 'b': 20, 'c': 30, 'd': 40} <class 'dict'>

In [10]:
def emp(**a):
    print(a,type(a))

In [13]:
emp(name='Anmol',age=22,city='Noida')

{'name': 'Anmol', 'age': 22, 'city': 'Noida'} <class 'dict'>

In [16]:
def record(**data):
    print(data)

In [17]:
record(name='Gunjan')

{'name': 'Gunjan'}

# Anonymous function

- The function without any name is an anonymous function.
- lambda keyword is used to define an anonymous function.

In [22]:
# (lambda arguments:operation) (call)

In [26]:
# Create a lambda() that can add two numbers

(lambda a,b:a+b) (10,20)

30

In [28]:
x=(lambda x,y:x*y) (5,3)
print(x)

15

In [29]:
# We can assign the lambda() to a variable and then we can call that variable

In [31]:
x=lambda a,b:a+b
print(x,type(x))

<function <lambda> at 0x0000027662CB35E0> <class 'function'>

In [32]:
x(10,20)

30

In [33]:
x(5,6)

11

In [34]:
add=lambda x,y:x+y
mul=lambda x,y:x*y

In [35]:
add(2,4)

6

In [37]:
mul(2,4)

8

In [38]:
# lambda arguments:operation Ternary operator

In [43]:
# Take 2 numbers and return the maximum using anonymous function

mx=lambda a,b:a if a>b else b

In [45]:
mx(50,20)

20

In [51]:
# Take 3 numbers and return the maximum using anonymous function

mx=lambda a,b,c:a if a>b and a>c else b if b>a and b>c else c

mx(100,200,30)

200

In [52]:
# Take a number acnd return wheteher it is even or odd

num=lambda x:'even' if x%2==0 else 'odd'

In [54]:
num(25)

'odd'

In [55]:
def maximum(a,b,c):
    if a>b and a>c:
        return a
    elif b>c and b>a:
        return b
    else:
        return c

In [58]:
maximum(1000,200,30)

1000

In [59]:
import seaborn as sns

In [60]:
data=sns.load_dataset('titanic')
data.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [61]:
data.shape

(891, 15)

In [62]:
# male-1
# female-0

In [68]:
data['Gender']=data.sex.apply(lambda x: 1 if x=='male' else 0)

In [66]:
x='female'
(lambda x:1 if x=='male' else 0) (x)

0

In [69]:
data

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,Gender
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,1
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,0
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,0
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,1
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,0
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,0
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,1
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,1

In [70]:
def convert(x):
    if x=='male':
        return 1
    else:
        return 0

In [72]:
data['Convert']=data.sex.apply(convert)

In [73]:
data

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,Gender,Convert
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,1,1
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,0,0
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,0,0
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,0,0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,1,1
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,0,0
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,0,0
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,1,1
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,1,1

# filter()

- It takes two arguments. The first argument is a function and the second argument is an iterable
- It filters the values from the iterable on the basis of some condition.
- It returns a filter object.
- To fetch the values from the filter object we typecast it to list() or tuple()

In [76]:
lst=[1,2,3,4,5,6,7,8,9,10,11,12,13,14,15]

res=[]

# Fetch all the evn numbers

for i in lst:
    if i%2==0:
        res.append(i)
print(res)

[2, 4, 6, 8, 10, 12, 14]

In [82]:
# filter(function,iterable)
# filter(lambda function,iterable)
# filter(lambda argument:condition,iterable)


f=filter(lambda x:x%2==0,lst)

print(f)

res=list(f)
print(res)

<filter object at 0x00000276694C2880>
[2, 4, 6, 8, 10, 12, 14]

In [83]:
def even(x):
    if x%2==0:
        return x

In [85]:
list(filter(even,lst))

[2, 4, 6, 8, 10, 12, 14]

In [90]:
text='Hello everyone. I hope your learning is going well'

# Fetch all the vowels from the above text using filter()

lst=list(filter(lambda x:x in 'AEIOUaeiou',text))
print(lst)
len(lst)

['e', 'o', 'e', 'e', 'o', 'e', 'I', 'o', 'e', 'o', 'u', 'e', 'a', 'i', 'i', 'o', 'i', 'e']

18

In [93]:
text='Hello everyone. I hope your learning is going well'

len(list(filter(lambda x:x in 'AEIOUaeiou',text)))

18

In [95]:
def greet():
    print('Hello')
    print('How are you')

# map()